<div align=center>
    <span style="color:#2f84dd; font-size:42px">
          <strong>Pandas</strong>
    </span>
</div>

<div align=center>
    <span style="font-size:16px">
          Pandas is a Python library wich comes with methods to coleect, clean, export and analize data from many sources like csv files, SQL databases, Excel files, etc. Pandas has two main data structures, Series and DatFrames or tables, we can say that Pandas is the Excel of Python
    </span>
</div>

<span style="color:#2f84dd; font-size:24px">
    <strong>1. Install and Import Pandas</strong>
</span>

<span style="color:#2f84dd; font-size:20px">
    <strong>1.1. Installation</strong>
</span>

**Pip:**
```shell
pip install pandas
```

**Conda:**
```shell
conda install pandas
```

<span style="color:#2f84dd; font-size:20px">
    <strong>1.2. Import Pandas</strong>
</span>

In [1]:
import pandas as pd

<span style="color:#2f84dd; font-size:24px">
    <strong>2. Data Structures</strong>
</span>

<span style="color:#2f84dd; font-size:20px">
    <strong>2.1. Pandas Series</strong>
</span>

<span style="font-size:16px">

A <strong>one-dimensional</strong> labeled array by an index, capable of golding any data type    
</span>

In [6]:
# create a Series
data_series = ['Manchester United', 'FC BArcelona', 'Real Madrid', 'Bayer Munich', 'Juentus',
              'Borussia Dortmund', 'Paris Saint Germain', 'Young Boys']
teams_serie = pd.Series(data=data_series)
teams_serie

0      Manchester United
1           FC BArcelona
2            Real Madrid
3           Bayer Munich
4                Juentus
5      Borussia Dortmund
6    Paris Saint Germain
7             Young Boys
dtype: object

<span style="color:#2f84dd; font-size:20px">
    <strong>2.2. DataFrame</strong>
</span>

<span style="font-size:16px">

    A DataFrame is a multi-dimensional data structure in pandas that consists of columns and rows and an index for each row, if a Series is an only one column a DataFrame is whole table
</span>

In [3]:
# Create a DataFrame

data_df = {
    'Country': [
        'Ecuador', 'Colombia', 'Germany', 'Japan', 'Netherlands', 'Congo Republic', 'Canada', 'South Korea',
        'Saudi Arabia', 'United Arab Emirates', 'Mexico', 'New Zealand', 'Ivory Coast'
    ],
    'Continent': [
        'America', 'America', 'Europe', 'Asia', 'Europe', 'Africa', 'America', 'Asia', 'Asia',
        'Asia', 'America', 'Oceania', 'Africa'
    ]
}

df = pd.DataFrame(data_df)
df

                 Country Continent
0                Ecuador   America
1               Colombia   America
2                Germany    Europe
3                  Japan      Asia
4            Netherlands    Europe
5         Congo Republic    Africa
6                 Canada   America
7            South Korea      Asia
8           Saudi Arabia      Asia
9   United Arab Emirates      Asia
10                Mexico   America
11           New Zealand   Oceania
12           Ivory Coast    Africa

<span style="color:#2f84dd; font-size:20px">
    <strong>2.3 DataFrame with Custom Index</strong>
</span>

In [58]:
animals_df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
      index=['lion', 'leopard', 'gazelle'],
      columns=['max_speed', 'shield'])
animals_df

         max_speed  shield
lion             1       2
leopard          4       5
gazelle          7       8

<span style="color:#2f84dd; font-size:24px">
    <strong>3. Indexing | Slicing</strong>
</span>

In [7]:
# get an element of a series
teams_serie[0]

'Manchester United'

In [8]:
# get a column of a df
df['Country']

0                  Ecuador
1                 Colombia
2                  Germany
3                    Japan
4              Netherlands
5           Congo Republic
6                   Canada
7              South Korea
8             Saudi Arabia
9     United Arab Emirates
10                  Mexico
11             New Zealand
12             Ivory Coast
Name: Country, dtype: object

In [9]:
# get first 5 row
df.head()

       Country Continent
0      Ecuador   America
1     Colombia   America
2      Germany    Europe
3        Japan      Asia
4  Netherlands    Europe

In [10]:
# get 2 first rows
df.head(2)

    Country Continent
0   Ecuador   America
1  Colombia   America

In [11]:
# get last 5 rows
df.tail()

                 Country Continent
8           Saudi Arabia      Asia
9   United Arab Emirates      Asia
10                Mexico   America
11           New Zealand   Oceania
12           Ivory Coast    Africa

In [12]:
# get a specific row and column - row 0 column 1
df.iloc[0,1]

'America'

In [17]:
# getting all rows and only row 0
df.iloc[:, 0:1]

                 Country
0                Ecuador
1               Colombia
2                Germany
3                  Japan
4            Netherlands
5         Congo Republic
6                 Canada
7            South Korea
8           Saudi Arabia
9   United Arab Emirates
10                Mexico
11           New Zealand
12           Ivory Coast

In [18]:
# getting rows 1-6 and all columns
df.iloc[1:7, 0:2]

          Country Continent
1        Colombia   America
2         Germany    Europe
3           Japan      Asia
4     Netherlands    Europe
5  Congo Republic    Africa
6          Canada   America

In [24]:
# get data by index
df.loc[0], animals_df.loc[['leopard', 'gazelle']]

(Country      Ecuador
 Continent    America
 Name: 0, dtype: object,
          max_speed  shield
 leopard          4       5
 gazelle          7       8)

<span style="color:#2f84dd; font-size:24px">
    <strong>4. Retrieving DataFrame Information</strong>
</span>

In [27]:
# no of (rows, column)
df.shape

(13, 2)

In [30]:
# describe index
df.index

RangeIndex(start=0, stop=13, step=1)

In [31]:
# return name of columns
df.columns

Index(['Country', 'Continent'], dtype='object')

In [32]:
# info of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    13 non-null     object
 1   Continent  13 non-null     object
dtypes: object(2)
memory usage: 336.0+ bytes

In [34]:
# statistical description
df.describe()

        Country Continent
count        13        13
unique       13         5
top     Ecuador   America
freq          1         4

In [36]:
# min value of dataframe
df.min()

Country      Canada
Continent    Africa
dtype: object

In [37]:
# max value of dataframe
df.max()

Country      United Arab Emirates
Continent                 Oceania
dtype: object

In [38]:
# min value of a column
animals_df['max_speed'].min()

1

In [39]:
# max value of a column
animals_df['max_speed'].max()

7

In [40]:
# mean of a column
animals_df.max_speed.mean()

4.0

In [41]:
# median of a column
animals_df.max_speed.median()

4.0

In [42]:
# mode of a colum
df['Continent'].mode()

0    America
1       Asia
Name: Continent, dtype: object

In [44]:
# return unique values of a column
df['Continent'].unique()

array(['America', 'Europe', 'Asia', 'Africa', 'Oceania'], dtype=object)

In [46]:
# count each unique value
df['Continent'].value_counts()

America    4
Asia       4
Europe     2
Africa     2
Oceania    1
Name: Continent, dtype: int64

In [48]:
# verify if exists missing values
df.isna().sum()

Country      0
Continent    0
dtype: int64

<span style="color:#2f84dd; font-size:24px">
    <strong>5.Applying Functions</strong>
</span>

In [59]:
f = lambda x: x*10
animals_df['max_speed_10'] = animals_df['max_speed'].apply(f)
animals_df

         max_speed  shield  max_speed_10
lion             1       2            10
leopard          4       5            40
gazelle          7       8            70

<span style="color:#2f84dd; font-size:24px">
    <strong>6.I/O Tools</strong>
</span>

<span style="color:#2f84dd; font-size:20px">
    <strong>6.1 Read | Write CSV Files</strong>
</span>

In [63]:
# read csv file
csv_df = pd.read_csv('./data/penguins.csv')

# print first 5 rows
csv_df.head()

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
0,PAL0708,1,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A1,Yes,11/11/07,39.1,18.7,181.0,3750.0,MALE,NaN,NaN,Not enough blood for isotopes.
1,PAL0708,2,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A2,Yes,11/11/07,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,NaN
2,PAL0708,3,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A1,Yes,11/16/07,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,NaN
3,PAL0708,4,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A2,Yes,11/16/07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Adult not sampled.
4,PAL0708,5,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N3A1,Yes,11/16/07,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426,NaN

In [64]:
# filte data
csv_df[ csv_df['Region'] == 'Anvers' ]

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
0,PAL0708,1,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A1,Yes,11/11/07,39.1,18.7,181.0,3750.0,MALE,NaN,NaN,Not enough blood for isotopes.
1,PAL0708,2,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A2,Yes,11/11/07,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,NaN
2,PAL0708,3,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A1,Yes,11/16/07,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,NaN
3,PAL0708,4,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A2,Yes,11/16/07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Adult not sampled.
4,PAL0708,5,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N3A1,Yes,11/16/07,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,PAL0910,120,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N38A2,No,12/1/09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
340,PAL0910,121,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N39A1,Yes,11/22/09,46.8,14.3,215.0,4850.0,FEMALE,8.41151,-26.13832,NaN
341,PAL0910,122,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N39A2,Yes,11/22/09,50.4,15.7,222.0,5750.0,MALE,8.30166,-26.04117,NaN
342,PAL0910,123,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N43A1,Yes,11/22/09,45.2,14.8,212.0,5200.0,FEMALE,8.24246,-26.11969,NaN
343,PAL0910,124,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N43A2,Yes,11/22/09,49.9,16.1,213.0,5400.0,MALE,8.36390,-26.15531,NaN

In [67]:
# write a csv file
# save a csv file of penguins species from Anvers region

species_anvers = csv_df[ csv_df['Region'] == 'Anvers' ][['Species', 'Region']]
species_anvers.to_csv('./data/penguien-speciens_anvers.csv')

<span style="color:#2f84dd; font-size:20px">
    <strong>6.2 Read | Write Excel Files</strong>
</span>

When we want read an Excel file we need to install a Python package *openxl*

In [68]:
# read a worbook
wb = pd.ExcelFile('./data/airports.xlsx')

# return sheet names
wb.sheet_names

['airports', 'type_of_airports', 'latam_airports']

In [69]:
# read an specific sheet
excel_df = pd.read_excel('./data/airports.xlsx', sheet_name='airports')
excel_df

,id,ident,type,name,latitude_deg,longitude_deg,elevation_ft,continent,iso_country,iso_region,municipality,scheduled_service,gps_code,iata_code,local_code,home_link,wikipedia_link,keywords
0,6523,00A,heliport,Total Rf Heliport,40.070801,-74.933601,11.0,NaN,US,US-PA,Bensalem,no,00A,NaN,00A,NaN,NaN,NaN
1,323361,00AA,small_airport,Aero B Ranch Airport,38.704022,-101.473911,3435.0,NaN,US,US-KS,Leoti,no,00AA,NaN,00AA,NaN,NaN,NaN
2,6524,00AK,small_airport,Lowell Field,59.947733,-151.692524,450.0,NaN,US,US-AK,Anchor Point,no,00AK,NaN,00AK,NaN,NaN,NaN
3,6525,00AL,small_airport,Epps Airpark,34.864799,-86.770302,820.0,NaN,US,US-AL,Harvest,no,00AL,NaN,00AL,NaN,NaN,NaN
4,6526,00AR,closed,Newport Hospital & Clinic Heliport,35.608700,-91.254898,237.0,NaN,US,US-AR,Newport,no,NaN,NaN,NaN,NaN,NaN,00AR
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74666,46378,ZZ-0001,heliport,Sealand Helipad,51.894444,1.482500,40.0,EU,GB,GB-ENG,Sealand,no,NaN,NaN,NaN,http://www.sealandgov.org/,https://en.wikipedia.org/wiki/Principality_of_...,Roughs Tower Helipad
74667,307326,ZZ-0002,small_airport,Glorioso Islands Airstrip,-11.584278,47.296389,11.0,AF,TF,TF-U-A,Grande Glorieuse,no,NaN,NaN,NaN,NaN,NaN,NaN
74668,346788,ZZ-0003,small_airport,Fainting Goat Airport,32.110587,-97.356312,690.0,NaN,US,US-TX,Blum,no,87TX,NaN,87TX,NaN,NaN,NaN
74669,342102,ZZZW,closed,Scandium City Heliport,69.355287,-138.939310,4.0,NaN,CA,CA-YT,(Old) Scandium City,no,NaN,NaN,NaN,NaN,NaN,"ZZZW, ZZZW, ZYW, YK96"
74670,313629,ZZZZ,small_airport,Satsuma Iōjima Airport,30.784722,130.270556,338.0,AS,JP,JP-46,Mishima,no,RJX7,NaN,RJX7,NaN,http://wikimapia.org/6705190/Satsuma-Iwo-jima-...,"SATSUMA,IWOJIMA,RJX7"

In [70]:
# write an excel file
species_anvers.to_excel('./data/species.xlsx')

<span style="color:#2f84dd; font-size:20px">
    <strong>6.2 Read | Write SQL Databases</strong>
</span>

With Pandas we can read SQL databases and export dataframes like a table to a SQL database, for this task we need some things:

1. Install sqlalchemy
   * `pip install SQLAchemy`
2. Install the driver for our database engine
   * PostgreSQL - psycopg2
   * MySQL -> mysql-connector-python
   * Oracle -> python-oracledb
   * MS SQL Server -> pymssql
3. Import libraries and the create_engine function from sqlalchemy
4. Create the engine with create_engine function
    * For this step you can view [documentation](https://docs.sqlalchemy.org/en/20/core/engines.html)
    
*For this example I will use SQLite*

In [85]:
from sqlalchemy import create_engine, text
import os 
basedir = os.path.abspath( os.path.dirname('Pandas') )
engine = create_engine( f'sqlite:///{os.path.join(basedir, "data/airport.db")}' )
query = 'SELECT * FROM airport'

sql_df = pd.read_sql(sql=text(query), con= engine.connect())
sql_df

   airport_id                                     name   country
0           1  Aeropuerto Internacional Mariscal Sucre   Ecuador
1           2       Aeropuerto Internacional Guaruhlos    Brasil
2           3       Aeropuerto Internacional El Dorado  Colombia

In [88]:
# create a new table in db
employee = {
    'Name': ['Arturo', 'Rachel', 'Saul', 'Cathie']
}

employee_df = pd.DataFrame(employee)
employee_df.to_sql('employee', engine)

4

<div align=center>
    <img src='./new_table.png' />
</div>